rails-app/app/controllers/audios_controller.rb

  def index
    @audios = Audio.all
---
SELECT "audios".* FROM "audios"

  def create
    @url = 'http://10.0.190.50:3000/' + @audio_path # Creates the url to store
    respond_to do |format|
      if audio_params[:store] == "0" && @audio_path.present? # If stream only
        format.html { redirect_to new_audio_path, notice: 'Audio was sent for streaming.'}
        format.json { render :show, status: :created, location: @url }
      elsif audio_params[:store] == "1" && @audio_path.present? # If stream and save
        @audio = Audio.new({ :text => audio_params[:text], :url => @url })
        if @audio.save
---
INSERT INTO "audios" ("text", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "I will save this one."], ["url", "http://10.0.190.50:3000/audio/i_will_save_this_one.mp3"], ["created_at", "2016-05-03 22:34:07.560601"], ["updated_at", "2016-05-03 22:34:07.560601"]]

  def destroy
    @audio.destroy
---
DELETE FROM "audios" WHERE "audios"."id" = $1  [["id", 980190962]]

    def set_audio
      @audio = Audio.find(params[:id])
---
SELECT  "audios".* FROM "audios" WHERE "audios"."id" = $1 LIMIT 1  [["id", 980190962]]