rails-app/app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT "devices".* FROM "devices"

  def create
    puts device_params
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO "devices" ("location", "ip_host", "device_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "MyString"], ["ip_host", "MyString"], ["device_type", "MyString"], ["created_at", "2016-05-03 22:19:18.668382"], ["updated_at", "2016-05-03 22:19:18.668382"]]

  def destroy
    @device.destroy
---
DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 980190962]]

    def set_device
      @device = Device.find(params[:id])
---
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT 1  [["id", 980190962]]